package com.example.HomeWorkPodShop

import com.example.HomeWorkPodShop.models.ModelClass

abstract class Constants {
    companion object{
        val array = arrayListOf(
            ModelClass(
                "https://vapenews.ru/uploads/images/00/59/24/2020/08/06/3c6489.jpg",
                "SMPO KII Starter Kit Pod",
                "Горячая новинка от производителя \"SMPO\". Компактный и стильный POD заменяет обычные сигареты и предоставляет исключительно сигаретную затяжку. А конструкция изготовлена так, что исключает любые проявления протечек жидкости!",
            "Характеристики:\n" +
                    "Размер: 83 х 34 х 13.8мм\n" +
                    "Вес: 50г\n" +
                    "Материал корпуса: пластик\n" +
                    "Питание: встроенный 650мАч\n" +
                    "Чипсет: CTAP\n" +
                    "Емкость картриджа: 1.8мл\n" +
                    "Выходная мощность: 10 — 15Вт\n" +
                    "Защита: от низкого / высокого сопротивления, от перегрева, от короткого замыкания, от перезаряда / переразряда\n" +
                    "Тип коннектора: магнитный\n" +
                    "Micro-USB порт/зарядка: есть, ток зарядки 1А\n" +
                    "Зарядка: 45 минут"
            ),
            ModelClass(
                "https://www.vapesale24.com/4507-large/voopoo-vmate-pod.jpg",
                "Voopoo VMATE Pod",
                "VMATE Pod — это ароматное, простое в использовании и недорогое стартовое устройство следующего поколения. Обеспечивает самое полное разрешение и вкус. Многоразовая капсула, изготовленная из материалов медицинского назначения, позволяет вам выбрать свой любимый вкус. Начнем с VMATE!",
                "VOOPOO Vmate Pod Kit имеет встроенную батарею емкостью 900 мАч, встроенный картридж объемом 3,0 мл, максимальную выходную мощность 17 Вт, с быстрой зарядкой Type-C 5 В / 1 А и использует технологию распыления нового поколения для создания сильного вкуса. Vmate Pod Kit обладает отличным вкусом в сочетании с простым в использовании и легким дизайном, подходящим для вейперов любого уровня опыта.\n" +
                        "\n"
            ),
            ModelClass(
                "https://belvaping.com/wp-content/uploads/2021/06/Vaporesso-GTX-GO-40-Pod-Kit-1_YPegk.jpeg",
                "Vaporesso GTX GO 40",
                "Vaporesso GTX Go 40 POD kit – компактный трубопод, оснащенный аккумулятором средней емкости. Рассчитан на использование испарителей серии GTX с тремя орингами, за счёт этих оргингов количество протечек будет сведено к минимуму.",
                "Характеристики -\n" +
                        "- Объем картриджа: 3,5 мл \n" +
                        "- Заправка: верхняя (крышка и клапан) \n" +
                        "- Емкость аккумулятора: 1500 мАч. \n" +
                        "- Поддерживаемое сопротивление: 0,1 — 2 Ом. \n" +
                        "- Выходное напряжение: 0 — 4 В\n" +
                        "- Мощность  - до 40 w.\n" +
                        " "
            ),
            ModelClass(
                "https://img5.lalafo.com/i/posters/original/ca/d4/e4/e090841f823fbfec91d007b34f.jpeg",
                "Одноразовая сигарета NobVape 1500 5%",
                "Nobvape - одноразовый электронный испаритель \n" +
                        "Бак данного испарителя предзаправлен 5 мл жидкостью. Ёмкость аккумулятора рассчитана на 900 mAh.\n" +
                        "Количество затяжек, заявленное производителем – 1500!\n" +
                        "Линейка вкусов состоит из 10 видов, заточенные под тропический стиль с добавлением холодка: ",
"1) Ананас \n" +
        "2) Банан\n" +
        "3) Канталупа (Дыня)\n" +
        "4) Гуава\n" +
        "5) Манго\n" +
        "6) Арбуз\n" +
        "7) Мята\n" +
        "8) Клубника \n" +
        "9) Апельсин\n" +
        "10) Конфеты"            ),
            ModelClass(
                "https://www.sigaretnet.by/images/stories/virtuemart/product/vaporesso-renova-zero-mesh-blue-2.jpg",
                "Vaporesso Zero POD",
                "Vaporesso Renova ZERO Pod – компактная под-система от именитого бренда, которая отличается минималистичными размерами, ярким дизайном, эргономичной формой и высокими функциональными характеристиками.",
                "Характеристики:\n" +
                        "Размер: 31 х 13,5 х 80,2 мм\n" +
                        "Аккумулятор: Встроенного 650 mah\n" +
                        "Емкость: 2 мл мл\n" +
                        "Максимальная мощность: 9-12.5 Вт\n" +
                        "Тип коннектора: 510\n" +
                        "Режимы работы: WV"
            ),
        )
    }
}